План_полетов_файловый_edt/src/Documents/ФормаС/ФормаС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормаС</name>
  <registerRecords>InformationRegister.СоздателиФормаС</registerRecords>
  <registerRecords>InformationRegister.СвязьФормаСПрилетВылет</registerRecords>
  <registerRecords>AccumulationRegister.ДанныеФормС</registerRecords>
  <registerRecords>InformationRegister.ОтветственныеФормаС</registerRecords>
  <attributes>
    <name>РейсПрибытия</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецВС</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВС</name>
    <type>
      <types>CatalogRef.ТипыВоздушныхСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяПосадки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяВылета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Масса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучноеРедактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прилет</name>
    <type>
      <types>DocumentRef.Прилеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вылет</name>
    <type>
      <types>DocumentRef.Вылеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <type>
      <types>CatalogRef.ПредставителиАвиакомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РейсОтправления</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ПревышениеРегламента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <comment>Истина - У.Е., Ложь - Рубль</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

План_полетов_файловый_edt/src/InformationRegisters/ОтветственныеФормаС/ОтветственныеФормаС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеФормаС</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ФормаС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

План_полетов_файловый_edt/src/Enums/ВидыПолета/ВидыПолета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПолета</name>
  <enumValues>
    <name>Российский</name>
  </enumValues>
  <enumValues>
    <name>Иностранный</name>
  </enumValues>
  <enumValues>
    <name>Ведомственный</name>
  </enumValues>
</mdclass:Enum>

План_полетов_файловый_edt/src/Catalogs/Услуги/Услуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Услуги</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СборЗаВзлётПосадку</name>
      <description>Сбор за взлёт-посадку</description>
    </items>
    <items>
      <name>СборЗаСверхнормативнуюСтоянкуИ</name>
      <description>Сбор за сверхнормативную стоянку</description>
    </items>
    <items>
      <name>СборЗаСверхнормативнуюСтоянкуР</name>
      <description>Сбор за сверхнормативную стоянку</description>
    </items>
  </predefined>
  <attributes>
    <name>Служба</name>
    <type>
      <types>EnumRef.Службы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <type>
      <types>EnumRef.ТипУслуги</types>
    </type>
  </attributes>
</mdclass:Catalog>

План_полетов_файловый_edt/src/Documents/ФормаС/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ФормаС.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФормаС.ВладелецВС КАК ВладелецВС,
	|	ФормаС.Дата КАК Дата,
	|	ФормаС.ДатаИВремяВылета КАК ДатаИВремяВылета,
	|	ФормаС.ДатаИВремяПосадки КАК ДатаИВремяПосадки,
	|	ФормаС.Итого КАК Итого,
	|	ФормаС.КурсВалюты КАК КурсВалюты,
	|	ФормаС.Масса КАК Масса,
	|	ФормаС.Плательщик КАК Плательщик,
	|	ФормаС.РейсОтправления КАК РейсОтправления,
	|	ФормаС.РейсПрибытия КАК РейсПрибытия,
	|	ФормаС.СпособОплаты КАК СпособОплаты,
	|	ФормаС.ТипВС КАК ТипВС,
	|	ФормаС.Услуги.(
	|		НомерСтроки КАК НомерСтроки,
	|		Услуга КАК Услуга,
	|		ПревышениеРегламента КАК ПревышениеРегламента,
	|		Количество КАК Количество,
	|		Услуга.ЕдиницаИзмерения КАК УслугаЕдиницаИзмерения,
	|		Цена КАК Цена,
	|		НДС КАК НДС,
	|		Скидка КАК Скидка,
	|		Сумма КАК Сумма,
	|		Услуга.ТипУслуги КАК ТипУслуги,
	|		Услуга.ТипУслуги.Порядок КАК УслугаТипУслугиПорядок,
	|		Услуга.НаименованиеНаАнглийском КАК УслугаНаименованиеНаАнглийском,
	|		Услуга.ЕдиницаИзмерения.НаименованиеНаАнглийскомЯзыке КАК УслугаЕдиницаИзмеренияНаименованиеНаАнглийскомЯзыке,
	|		Валюта КАК Валюта
	|	) КАК Услуги,
	|	ФормаС.ИтогоНДС КАК ИтогоНДС,
	|	ФормаС.Итого - ФормаС.ИтогоНДС КАК ИтогоБезНДС,
	|	ФормаС.Номер КАК Номер,
	|	ФормаС.Представитель КАК Представитель,
	|	ФормаС.НомерБорта КАК НомерБорта,
	|	ОтветственныеФормаС.Пользователь КАК Диспетчер,
	|	ФормаС.Примечание КАК Примечание,
	|	ФормаС.Прилет.АэропортВылета КАК ПрилетАэропортВылета,
	|	ФормаС.Прилет.АэропортПрилета КАК ПрилетАэропортПрилета,
	|	ФормаС.Вылет.АэропортПрилета КАК ВылетАэропортПрилета,
	|	ФормаС.Прилет.АэропортВылета.НаименованиеНаАнглийском КАК ПрилетАэропортВылетаНаименованиеНаАнглийском,
	|	ФормаС.Прилет.АэропортПрилета.НаименованиеНаАнглийском КАК ПрилетАэропортПрилетаНаименованиеНаАнглийском,
	|	ФормаС.Вылет.АэропортПрилета.НаименованиеНаАнглийском КАК ВылетАэропортПрилетаНаименованиеНаАнглийском
	|ИЗ
	|	РегистрСведений.ОтветственныеФормаС КАК ОтветственныеФормаС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ФормаС КАК ФормаС
	|		ПО ОтветственныеФормаС.Регистратор = ФормаС.Ссылка
	|ГДЕ
	|	ФормаС.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	УслугаТипУслугиПорядок,
	|	НомерСтроки";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьЗаголовок1 = Макет.ПолучитьОбласть("Заголовок1");
	Шапка1 = Макет.ПолучитьОбласть("Шапка1");
	ОбластьУслугиШапка1 = Макет.ПолучитьОбласть("УслугиШапка1");
	ОбластьУслуги1 = Макет.ПолучитьОбласть("Услуги1");
	Подвал1 = Макет.ПолучитьОбласть("Подвал1");
	
	ОбластьЗаголовок2 = Макет.ПолучитьОбласть("Заголовок2");
	Шапка2 = Макет.ПолучитьОбласть("Шапка2");
	ОбластьУслугиШапка2 = Макет.ПолучитьОбласть("УслугиШапка2");
	ОбластьУслуги2 = Макет.ПолучитьОбласть("Услуги2");
	Подвал2 = Макет.ПолучитьОбласть("Подвал2");
	
	УслугиТип = Макет.ПолучитьОбласть("УслугиТип");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если Выборка.ВладелецВС.ВидКонтрагента = Перечисления.ВидыПолета.Российский Тогда 
			ОбластьЗаголовок.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьЗаголовок);
			Шапка.Параметры.Заполнить(Выборка);
			Шапка.Параметры.Направление = "" + Выборка.ПрилетАэропортВылета + "-" + Выборка.ПрилетАэропортПрилета + "-"  + Выборка.ВылетАэропортПрилета;
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			ТабДок.Вывести(ОбластьУслугиШапка);
		ИначеЕсли Выборка.ВладелецВС.ВидКонтрагента = Перечисления.ВидыПолета.Ведомственный Тогда 
			ОбластьЗаголовок1.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьЗаголовок1);
			Шапка1.Параметры.Заполнить(Выборка);
			Шапка1.Параметры.Направление = "" + Выборка.ПрилетАэропортВылета + "-" + Выборка.ПрилетАэропортПрилета + "-"  + Выборка.ВылетАэропортПрилета;
			ТабДок.Вывести(Шапка1, Выборка.Уровень());
			ТабДок.Вывести(ОбластьУслугиШапка1);
		ИначеЕсли Выборка.ВладелецВС.ВидКонтрагента = Перечисления.ВидыПолета.Иностранный Тогда 
			ОбластьЗаголовок2.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьЗаголовок2);
			Шапка2.Параметры.Заполнить(Выборка);
			Шапка2.Параметры.Направление = "" + Выборка.ПрилетАэропортВылетаНаименованиеНаАнглийском + "-" + Выборка.ПрилетАэропортПрилетаНаименованиеНаАнглийском + "-"  + Выборка.ВылетАэропортПрилетаНаименованиеНаАнглийском;
			ТабДок.Вывести(Шапка2, Выборка.Уровень());
			ТабДок.Вывести(ОбластьУслугиШапка2);	
		КонецЕсли;	
				
		ВыборкаУслуги = Выборка.Услуги.Выбрать();
		ТекущийТип = Перечисления.ТипУслуги.ПустаяСсылка();
		Пока ВыборкаУслуги.Следующий() Цикл
			УслугиТип.Параметры.Заполнить(ВыборкаУслуги);
			Если ВыборкаУслуги.ТипУслуги <> ТекущийТип Тогда 
				ТабДок.Вывести(УслугиТип, ВыборкаУслуги.Уровень());
				ТекущийТип=УслугиТип.Параметры.ТипУслуги;
			КонецЕсли;	
			
			Если Выборка.ВладелецВС.ВидКонтрагента = Перечисления.ВидыПолета.Российский Тогда 
				ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
				ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
			ИначеЕсли Выборка.ВладелецВС.ВидКонтрагента = Перечисления.ВидыПолета.Ведомственный Тогда 
				ОбластьУслуги1.Параметры.Заполнить(ВыборкаУслуги);
				ТабДок.Вывести(ОбластьУслуги1, ВыборкаУслуги.Уровень());
			ИначеЕсли Выборка.ВладелецВС.ВидКонтрагента = Перечисления.ВидыПолета.Иностранный Тогда 
				ОбластьУслуги2.Параметры.Заполнить(ВыборкаУслуги);
				
				
				Если ВыборкаУслуги.ПревышениеРегламента Тогда 
					ОбластьУслуги2.Параметры.ПревышениеРегламента = "да / yes";		
				Иначе 
					ОбластьУслуги2.Параметры.ПревышениеРегламента = "нет / no";
				КонецЕсли;	
				
				ОбластьУслуги2.Параметры.Услуга = "" + ВыборкаУслуги.Услуга + " / " + ВыборкаУслуги.УслугаНаименованиеНаАнглийском;
				ОбластьУслуги2.Параметры.УслугаЕдиницаИзмерения = "" + ВыборкаУслуги.УслугаЕдиницаИзмерения + " / " + ВыборкаУслуги.УслугаЕдиницаИзмеренияНаименованиеНаАнглийскомЯзыке;
				Если ВыборкаУслуги.Валюта Тогда 
					ОбластьУслуги2.Параметры.Ценауе = Окр(ВыборкаУслуги.Цена / Выборка.КурсВалюты ,2);
				Иначе 
					ОбластьУслуги2.Параметры.Ценауе = "";
				КонецЕсли;
				Если ВыборкаУслуги.Услуга = Справочники.Услуги.СборЗаСверхнормативнуюСтоянкуИ Тогда 
					ОбластьУслуги2.Параметры.Количество = Окр(ВыборкаУслуги.Количество / Выборка.Масса,2);
					ОбластьУслуги2.Параметры.Цена = Окр(ВыборкаУслуги.Цена * Выборка.Масса,2);
					ОбластьУслуги2.Параметры.Ценауе = "";
					ОбластьУслуги2.Параметры.Сумма = Окр(ВыборкаУслуги.Количество / Выборка.Масса,2) * Окр(ВыборкаУслуги.Цена * Выборка.Масса,2); 
				КонецЕсли;	
				ТабДок.Вывести(ОбластьУслуги2, ВыборкаУслуги.Уровень());
			КонецЕсли;	
			
		КонецЦикла;

		Если Выборка.ВладелецВС.ВидКонтрагента = Перечисления.ВидыПолета.Российский Тогда 
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал);
		ИначеЕсли Выборка.ВладелецВС.ВидКонтрагента = Перечисления.ВидыПолета.Ведомственный Тогда 
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
			Подвал1.Параметры.СуммаПрописью = "Работы выполнены в сумме " + ЧислоПрописью(Выборка.Итого, ФормСтрока, ПарПредмета) + " в полном объеме и в срок";
			Подвал1.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал1);
		ИначеЕсли Выборка.ВладелецВС.ВидКонтрагента = Перечисления.ВидыПолета.Иностранный Тогда 
			Подвал2.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал2);			
		КонецЕсли;
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
